RIET/src/Documents/BoxesOfCustomsFiles/BoxesOfCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BoxesOfCustomsFiles</name>
  <posting>Deny</posting>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>DispatchDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ListOfCustomsFiles</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CustomsFiles</name>
    <attributes>
      <name>CustomsFile</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsFilesLight</name>
    <attributes>
      <name>CustomsFileLight</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/BoxesOfCustomsFiles/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТКА ЗАПОЛНЕНИЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипЗнчДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
			
	Если ТипЗнчДанныхЗаполнения = Тип("Структура") Тогда
		ДанныеЗаполнения.Свойство("ProcessLevel", ProcessLevel);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
		ProcessLevel = РГСофтСерверПовтИспСеанс.ПолучитьЗначениеРеквизита(ПараметрыСеанса.ТекущийПользователь, "ProcessLevel");	
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизитыБезДополнительныхДанных();
	
	ПроверитьРеквизитыБезДополнительныхДанных(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПоместитьДополнительныеДанныеВДополнительныеСвойства();
	
	ДозаполнитьРеквизитыСДополнительнымиДанными(ДополнительныеСвойства.ТаблицаCustomsFiles, ДополнительныеСвойства.ТаблицаCustomsFilesLight);
			
	ПроверитьРеквизитыСДополнительнымиДанными(
		Отказ,
		ДополнительныеСвойства.ТаблицаCustomsFiles,
		ДополнительныеСвойства.ТаблицаCustomsFilesLight,
		ДополнительныеСвойства.ВыборкаCustomsFilesInOtherBoxes,
		ДополнительныеСвойства.ВыборкаCustomsFilesLightInOtherBoxes);
		
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыБезДополнительныхДанных()
	
	Если ЭтоНовый() Тогда
		CreatedBy = ПараметрыСеанса.ТекущийПользователь;
		Дата = ТекущаяДата();
	КонецЕсли;
		
	Comment = СокрЛП(Comment);
	
	CustomsFiles.Свернуть("CustomsFile", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CustomsFiles, "CustomsFile");
	
	CustomsFilesLight.Свернуть("CustomsFileLight", "");
	ОбщегоНазначения.ОчиститьТаблицуОтСтрокСПустымиРеквизитами(CustomsFilesLight, "CustomsFileLight");
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизитыБезДополнительныхДанных(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ProcessLevel) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"""Process level"" is empty!",
			ЭтотОбъект, "ProcessLevel", , Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(DispatchDate) Тогда
		Возврат;
	КонецЕсли;
		
	Если CustomsFiles.Количество() = 0 И CustomsFilesLight.Количество() = 0 Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Lists of Customs files and Customs files (light) are empty!",
			ЭтотОбъект, "CustomsFiles", , Отказ);		
	КонецЕсли;
					
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

Процедура ПоместитьДополнительныеДанныеВДополнительныеСвойства()
	
	СтруктураПараметров = Новый Структура;
	СтруктураТекстов = Новый Структура;
	
	Если CustomsFiles.Количество() Тогда
		
		СтруктураПараметров.Вставить("CustomsFiles", CustomsFiles.ВыгрузитьКолонку("CustomsFile"));
		СтруктураТекстов.Вставить("РеквизитыCustomsFiles",
			"ВЫБРАТЬ
			|	CustomsFiles.Ссылка КАК CustomsFile,
			|	CustomsFiles.Номер КАК No,
			|	CustomsFiles.ProcessLevel КАК ProcessLevel
			|ИЗ
			|	Документ.ГТД КАК CustomsFiles
			|ГДЕ
			|	CustomsFiles.Ссылка В(&CustomsFiles)");
			
	КонецЕсли;
	
	Если CustomsFilesLight.Количество() Тогда
		
		СтруктураПараметров.Вставить("CustomsFilesLight", CustomsFilesLight.ВыгрузитьКолонку("CustomsFileLight"));
		СтруктураТекстов.Вставить("РеквизитыCustomsFilesLight",
			"ВЫБРАТЬ
			|	CustomsFilesLight.Ссылка КАК CustomsFileLight,
			|	CustomsFilesLight.Номер КАК No,
			|	CustomsFilesLight.ProcessLevel КАК ProcessLevel
			|ИЗ
			|	Документ.CustomsFilesLight КАК CustomsFilesLight
			|ГДЕ
			|	CustomsFilesLight.Ссылка В(&CustomsFilesLight)");
			
	КонецЕсли;
	
	Если НЕ ПометкаУдаления Тогда
		
		Если CustomsFiles.Количество() Тогда
			
			СтруктураПараметров.Вставить("Ссылка", Ссылка);
			СтруктураТекстов.Вставить("CustomsFilesInOtherBoxes",
				"ВЫБРАТЬ
				|	BoxesOfCustomsFilesCustomsFiles.Ссылка.Представление КАК BoxПредставление,
				|	BoxesOfCustomsFilesCustomsFiles.CustomsFile КАК CustomsFile,
				|	BoxesOfCustomsFilesCustomsFiles.CustomsFile.Представление КАК CustomsFileПредставление
				|ИЗ
				|	Документ.BoxesOfCustomsFiles.CustomsFiles КАК BoxesOfCustomsFilesCustomsFiles
				|ГДЕ
				|	BoxesOfCustomsFilesCustomsFiles.CustomsFile В(&CustomsFiles)
				|	И BoxesOfCustomsFilesCustomsFiles.Ссылка <> &Ссылка
				|	И НЕ BoxesOfCustomsFilesCustomsFiles.Ссылка.ПометкаУдаления");
				
		КонецЕсли;
		
		Если CustomsFilesLight.Количество() Тогда
			
			СтруктураПараметров.Вставить("Ссылка", Ссылка);
			СтруктураТекстов.Вставить("CustomsFilesLightInOtherBoxes",
				"ВЫБРАТЬ
				|	BoxesOfCustomsFilesCustomsFilesLight.Ссылка.Представление КАК BoxПредставление,
				|	BoxesOfCustomsFilesCustomsFilesLight.CustomsFileLight КАК CustomsFileLight,
				|	BoxesOfCustomsFilesCustomsFilesLight.CustomsFileLight.Представление КАК CustomsFileLightПредставление
				|ИЗ
				|	Документ.BoxesOfCustomsFiles.CustomsFilesLight КАК BoxesOfCustomsFilesCustomsFilesLight
				|ГДЕ
				|	BoxesOfCustomsFilesCustomsFilesLight.CustomsFileLight В(&CustomsFilesLight)
				|	И BoxesOfCustomsFilesCustomsFilesLight.Ссылка <> &Ссылка
				|	И НЕ BoxesOfCustomsFilesCustomsFilesLight.Ссылка.ПометкаУдаления");
				
		КонецЕсли;
		
	КонецЕсли; 
			
	УстановитьПривилегированныйРежим(Истина);
	СтруктураРезультатов = РГСофт.ПолучитьСтруктуруРезультатовТекстовЗапросов(СтруктураТекстов, СтруктураПараметров);
	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsFiles", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsFiles") Тогда
		ДополнительныеСвойства.ТаблицаCustomsFiles = СтруктураРезультатов.РеквизитыCustomsFiles.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsFiles.Индексы.Добавить("CustomsFile");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицаCustomsFilesLight", Неопределено);
	Если СтруктураРезультатов.Свойство("РеквизитыCustomsFilesLight") Тогда
		ДополнительныеСвойства.ТаблицаCustomsFilesLight = СтруктураРезультатов.РеквизитыCustomsFilesLight.Выгрузить();
		ДополнительныеСвойства.ТаблицаCustomsFilesLight.Индексы.Добавить("CustomsFileLight");
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ВыборкаCustomsFilesInOtherBoxes", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsFilesInOtherBoxes") Тогда
		ДополнительныеСвойства.ВыборкаCustomsFilesInOtherBoxes = СтруктураРезультатов.CustomsFilesInOtherBoxes.Выбрать();
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ВыборкаCustomsFilesLightInOtherBoxes", Неопределено);
	Если СтруктураРезультатов.Свойство("CustomsFilesLightInOtherBoxes") Тогда
		ДополнительныеСвойства.ВыборкаCustomsFilesLightInOtherBoxes = СтруктураРезультатов.CustomsFilesLightInOtherBoxes.Выбрать();
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизитыСДополнительнымиДанными(ТаблицаCustomsFiles, ТаблицаCustomsFilesLight)
	
	ListOfCustomsFiles = "";
	
	Если CustomsFiles.Количество() Тогда
		МассивCustomsFilesNo = ТаблицаCustomsFiles.ВыгрузитьКолонку("No");
		ListOfCustomsFiles = РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивCustomsFilesNo, ", ");
	КонецЕсли;		
	
	Если CustomsFilesLight.Количество() Тогда
		
		МассивCustomsFilesLightNo = ТаблицаCustomsFilesLight.ВыгрузитьКолонку("No");
		ListOfCustomsFilesLight = РГСофтКлиентСервер.ПолучитьСтрокуИзМассиваПодстрокСокрЛП(МассивCustomsFilesLightNo, ", ");
		
		Если ЗначениеЗаполнено(ListOfCustomsFiles) Тогда
			ListOfCustomsFiles = ListOfCustomsFiles + ", ";
		КонецЕсли;
		
		ListOfCustomsFiles = ListOfCustomsFiles + ListOfCustomsFilesLight;
		
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизитыСДополнительнымиДанными(Отказ, ТаблицаCustomsFiles, ТаблицаCustomsFilesLight, ВыборкаCustomsFilesInOtherBoxes, ВыборкаCustomsFilesLightInOtherBoxes)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
							
	// Убедимся, что указанные Customs files еще не попадали в коробки
	Если CustomsFiles.Количество() Тогда
		
		Пока ВыборкаCustomsFilesInOtherBoxes.Следующий() Цикл
			
			СтрокаТЧ = CustomsFiles.Найти(ВыборкаCustomsFilesInOtherBoxes.CustomsFile, "CustomsFile");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""" + ВыборкаCustomsFilesInOtherBoxes.CustomsFileПредставление + """ is already in """ + ВыборкаCustomsFilesInOtherBoxes.BoxПредставление + """!",
				ЭтотОбъект, "CustomsFiles[" + (СтрокаТЧ.НомерСтроки - 1) + "].CustomsFile", , Отказ);
				
		КонецЦикла;
			
	КонецЕсли;
	
	Если CustomsFilesLight.Количество() Тогда
		
		Пока ВыборкаCustomsFilesLightInOtherBoxes.Следующий() Цикл
			
			СтрокаТЧ = CustomsFilesLight.Найти(ВыборкаCustomsFilesLightInOtherBoxes.CustomsFileLight, "CustomsFileLight");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"""" + ВыборкаCustomsFilesLightInOtherBoxes.CustomsFileLightПредставление + """ is already in """ + ВыборкаCustomsFilesLightInOtherBoxes.BoxПредставление + """!",
				ЭтотОбъект, "CustomsFilesLight[" + (СтрокаТЧ.НомерСтроки - 1) + "].CustomsFileLight", , Отказ);
				
		КонецЦикла;
			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(DispatchDate) Тогда
		Возврат;
	КонецЕсли;
	
	// Убедимся, что для все Customs files проведены и их ProcessLevels соответствуют указанному в шапке
	Для Каждого СтрокаТЧ Из CustomsFiles Цикл
		
		РеквизитыCustomsFile = ТаблицаCustomsFiles.Найти(СтрокаТЧ.CustomsFile, "CustomsFile");
		
		Если РеквизитыCustomsFile.ProcessLevel <> ProcessLevel Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Process level """ + СокрЛП(РеквизитыCustomsFile.ProcessLevel) + """ of """ + СтрокаТЧ.CustomsFile + """ differs from Process level of the Box!",
				ЭтотОбъект, "CustomsFiles[" + (СтрокаТЧ.НомерСтроки - 1) + "].CustomsFile", , Отказ);
			
		КонецЕсли;
						
	КонецЦикла; 
	
	Для Каждого СтрокаТЧ Из CustomsFilesLight Цикл
		
		РеквизитыCustomsFileLight = ТаблицаCustomsFilesLight.Найти(СтрокаТЧ.CustomsFileLight, "CustomsFileLight");
		
		Если РеквизитыCustomsFileLight.ProcessLevel <> ProcessLevel Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Process level """ + СокрЛП(РеквизитыCustomsFileLight.ProcessLevel) + """ of """ + СтрокаТЧ.CustomsFileLight + """ differs from Process level of the Box!",
				ЭтотОбъект, "CustomsFilesLight[" + (СтрокаТЧ.НомерСтроки - 1) + "].CustomsFileLight", , Отказ);
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры
